Repository: lewandowski-jan/moti
Catalog: mobile/lib/l10n/app_*.arb
Languages: pl

# generic_error
source: Something went wrong!
pl: Coś poszło nie tak!

# activity_screen_pushups_done
source: You have already done pushups today, you will carry the logs!
pl: Już zrobiłeś dzisiaj pompki, ty będziesz nosił pnie!

# activity_screen_pushups_not_done
source: You have not done pushups today, who's gonna carry the logs?
pl: Nie zrobiłeś jeszcze dzisiaj pompek, kto zaniesie pnie?

# add_activity_add_pushups
source: Add pushups
pl: Dodaj pompki

# add_activity_amount
source: Amount
pl: Ilość

# add_activity_add
source: Add
pl: Dodaj

# streak_streak
source: Streak
pl: Seria

# streak_current_streak
source: Current
pl: Aktualna

# streak_longest_streak
source: Max
pl: Najdłuższa

# total_total
source: Total
pl: Razem

# total_today_total
source: Today
pl: Dzisiaj

# total_all_time_total
source: All time
pl: Zawsze

source: Settings
pl: Ustawienia

# settings_theme
source: Theme
pl: Motyw

# theme_system
source: System
pl: Systemowy

# theme_light
source: Light
pl: Jasny

# theme_dark
source: Dark
pl: Ciemny

# settings_language
source: Language
pl: Język

# language_polish
source: Polish
pl: Polski

# language_english
source: English
pl: Angielski

# reminders_reminder_title
source: Reminder
pl: Przypomnienie

# reminders_motivation_1
source: Get comfortable with being uncomfortable.
pl: Zacznij czuć się komfortowo w niekomforcie.

# reminders_motivation_2
source: Embrace the suck and keep pushing forward.
pl: Przyjmij trudności i ciągle idź naprzód.

# reminders_motivation_3
source: Your mind will quit a thousand times before your body will.
pl: Twoja psychika zrezygnuje tysiąc razy zanim to zrobi twoje ciało.

# reminders_motivation_4
source: Stay hard. Stay hungry. Stay alive.
pl: Bądź twardy. Bądź głodny. Bądź żywy.

# reminders_motivation_5
source: Be the hardest worker in the room, no matter what.
pl: Bądź najcięższym pracownikiem w pomieszczeniu, bez względu na wszystko.

# reminders_motivation_6
source: You're the master of your fate. Start acting like it.
pl: Jesteś panem swojego losu. Zacznij działać zgodnie z tym.

# reminders_motivation_7
source: The only way to grow is to suffer. Embrace it.
pl: Jedynym sposobem na wzrost jest cierpienie. Przyjmij je.

# reminders_motivation_8
source: Don't let your past dictate your future.
pl: Nie pozwól, aby twoja przeszłość dyktowała twoją przyszłość.

# reminders_motivation_9
source: Pain is temporary. Regret lasts forever.
pl: Ból jest tymczasowy. Żal trwa wiecznie.

# reminders_motivation_10
source: Become obsessed with becoming the best version of yourself.
pl: Stań się obsesyjny na punkcie stania się najlepszą wersją siebie.

# reminders_motivation_11
source: The only limits that exist are the ones you place on yourself.
pl: Jedynymi ograniczeniami, które istnieją, są te, które sam na siebie nakładasz.

# reminders_motivation_12
source: Stop making excuses. Start making progress.
pl: Przestań się usprawiedliwiać. Zacznij robić postępy.

# reminders_motivation_13
source: Greatness is earned, never given.
pl: Wielkość jest zdobywana, nigdy nie dawana.

# reminders_motivation_14
source: You can't cheat the grind.
pl: Nie możesz oszukiwać trudu.

# reminders_motivation_15
source: When you think you're done, you're only at 40% of your body's capability.
pl: Kiedy myślisz, że skończyłeś, jesteś dopiero na 40% swoich możliwości ciała.

# reminders_motivation_16
source: Embrace the struggle. It's where growth happens.
pl: Przyjmij trudności. To tam rozwój się dzieje.

# reminders_motivation_17
source: Stay hard when it's easy. Stay hard when it's tough. Stay hard always.
pl: Bądź twardy gdy jest łatwo. Bądź twardy gdy jest trudno. Zawsze bądź twardy.

# reminders_motivation_18
source: Don't wait for inspiration. Be the inspiration.
pl: Nie czekaj na inspirację. Bądź inspiracją.

# reminders_motivation_19
source: The path to greatness is paved with pain. Walk it proudly.
pl: Droga do wielkości jest wybrukowana bólem. Idź nią z dumą.

# reminders_motivation_20
source: Make the sacrifice today so you can become who you're meant to be tomorrow.
pl: Podejmij dzisiaj poświęcenie, abyś jutro mógł stać się kimś, kim jest przeznaczony być.

# reminders_motivation_21
source: Feel the pain and do it anyway.
pl: Poczuj ból i zrób to i tak.

# reminders_motivation_22
source: Rewrite your story, starting now.
pl: Przepisz swoją historię, zaczynając teraz.

# reminders_motivation_23
source: Who's gonna carry the boats?
pl: Kto będzie nosił łodzie?

# reminders_motivation_24
source: Don't be a bitch!
pl: Nie bądź pizdą!

# reminders_motivation_25
source: They don't know me son!
pl: Oni nie znają mnie, synu!

# reminders_motivation_26
source: If you want to shine like sun first you have to burn like it.
pl: Jeśli chcesz błyszczeć jak słońce najpierw musisz się spalić
